bouffalolab/bouffalo_sdk/drivers/bl702_driver/hal_drv/src/hal_usb.c
int usb_write(struct device *dev, uint32_t pos, const void *buffer, uint32_t size)
{
    struct usb_dc_device *usb_device = (struct usb_dc_device *)dev;
    uint8_t ep_idx = USB_EP_GET_IDX(pos);

    if(usb_device->in_ep[ep_idx].ep_cfg.ep_type == USBD_EP_TYPE_ISOC)
    {
        uint32_t usb_ep_addr = USB_BASE + 0x308 + ep_idx * 0x10;

        dma_channel_stop(usb_device->tx_dma);
        usb_lli_list.src_addr = (uint32_t)buffer;
        usb_lli_list.dst_addr = usb_ep_addr;
        usb_lli_list.cfg.bits.TransferSize = size;
        usb_lli_list.cfg.bits.DI = 0;
        usb_lli_list.cfg.bits.SI = 1;
        usb_lli_list.cfg.bits.SBSize = DMA_BURST_16BYTE;
        usb_lli_list.cfg.bits.DBSize = DMA_BURST_1BYTE;
        device_control(usb_device->tx_dma,DMA_CHANNEL_UPDATE,(void*)((uint32_t)&usb_lli_list));
        dma_channel_start(usb_device->tx_dma);
    }
    else
    {

    }
    return 0;
}

int usb_read(struct device *dev, uint32_t pos, void *buffer, uint32_t size)
{
    struct usb_dc_device *usb_device = (struct usb_dc_device *)dev;
    uint8_t ep_idx = USB_EP_GET_IDX(pos);

    if(usb_device->out_ep[ep_idx].ep_cfg.ep_type == USBD_EP_TYPE_ISOC)
    {
        uint32_t usb_ep_addr = USB_BASE + 0x308 + ep_idx * 0x1c;

        dma_channel_stop(usb_device->tx_dma);
        usb_lli_list.src_addr = usb_ep_addr;
        usb_lli_list.dst_addr = (uint32_t)buffer;
        usb_lli_list.cfg.bits.TransferSize = size;
        usb_lli_list.cfg.bits.DI = 1;
        usb_lli_list.cfg.bits.SI = 0;
        usb_lli_list.cfg.bits.SBSize = DMA_BURST_1BYTE;
        usb_lli_list.cfg.bits.DBSize = DMA_BURST_16BYTE;
        device_control(usb_device->rx_dma,DMA_CHANNEL_UPDATE,(void*)((uint32_t)&usb_lli_list));
        dma_channel_start(usb_device->rx_dma);
    }
    else
    {
        
    }
    return 0;
}

/**
 * @brief
 *
 * @param index
 * @param name
 * @param flag
 * @return int
 */
int usb_dc_register(enum usb_index_type index, const char *name, uint16_t flag)
{
    struct device *dev;

    if (USB_MAX_INDEX == 0)
        return -DEVICE_EINVAL;

    dev = &(usb_fs_device.parent);

    dev->open = usb_open;
    dev->close = usb_close;
    dev->control = usb_control;
    dev->write = usb_write;
    dev->read = usb_read;

    dev->status = DEVICE_UNREGISTER;
    dev->type = DEVICE_CLASS_USB;
    dev->handle = NULL;

    return device_register(dev, name, flag);
}

/**
 * @brief configure and enable endpoint
 * This function sets endpoint configuration according to one specified in USB
 * endpoint descriptor and then enables it for data transfers.
 *
 * @param dev
 * @param ep_cfg  ep_cfg Endpoint 
 * @return int
 */
int usb_dc_ep_open(struct device *dev, const struct usb_dc_ep_cfg *ep_cfg)
{
    uint8_t ep;
    EP_Config_Type epCfg;

    if (!ep_cfg)
    {
        return -1;
    }
    ep = ep_cfg->ep_addr;

    uint8_t ep_idx = USB_EP_GET_IDX(ep);

    USB_DC_LOG_DBG("%s ep %x, mps %d, type %d\r\n", __func__, ep, ep_cfg->ep_mps, ep_cfg->ep_type);

    if (USB_EP_DIR_IS_OUT(ep))
    {
        epCfg.dir = EP_OUT;
        epCfg.EPMaxPacketSize = ep_cfg->ep_mps;
        usb_fs_device.out_ep[ep_idx].ep_cfg.ep_mps = ep_cfg->ep_mps;
        usb_fs_device.out_ep[ep_idx].ep_cfg.ep_type = ep_cfg->ep_type;
    }
    else
    {
        epCfg.dir = EP_IN;
        epCfg.EPMaxPacketSize = ep_cfg->ep_mps;
        usb_fs_device.in_ep[ep_idx].ep_cfg.ep_mps = ep_cfg->ep_mps;
        usb_fs_device.in_ep[ep_idx].ep_cfg.ep_type = ep_cfg->ep_type;
    }

    if (ep_idx)
    {
        switch (ep_cfg->ep_type)
        {
            case USBD_EP_TYPE_CTRL:
                epCfg.type = USB_DC_EP_TYPE_CTRL;
                break;
            case USBD_EP_TYPE_ISOC:
                epCfg.type = USB_DC_EP_TYPE_ISOC;
                break;
            case USBD_EP_TYPE_BULK:
                epCfg.type = USB_DC_EP_TYPE_BULK;
                break;
            case USBD_EP_TYPE_INTR:
                epCfg.type = USB_DC_EP_TYPE_INTR;
                break;
            default:
                return -1;
        }
        USB_Set_EPx_Config(ep_idx, &epCfg);
        if (USB_EP_DIR_IS_OUT(ep))
        {
            /* Clear NAK and enable ep */
            USB_Set_EPx_Status(USB_EP_GET_IDX(ep), USB_EP_STATUS_ACK);
            usb_fs_device.out_ep[ep_idx].ep_ena = 1U;
        }
        else
        {
            //USB_Set_EPx_Status(USB_EP_GET_IDX(ep), USB_EP_STATUS_ACK);
            USB_Set_EPx_Status(USB_EP_GET_IDX(ep), USB_EP_STATUS_NACK);
            usb_fs_device.in_ep[ep_idx].ep_ena = 1U;
        }
    }
    else
    {
        if (USB_EP_DIR_IS_OUT(ep))
        {
            usb_fs_device.out_ep[ep_idx].ep_ena = 1U;
        }
        else
        {
            usb_fs_device.in_ep[ep_idx].ep_ena = 1U;
        }
    }

    return 0;
}

/**
 * @brief Check if the selected endpoint is stalled
 *
 * @param dev usb device
 * @param[in]  ep       Endpoint address corresponding to the one
 *                      listed in the device configuration table
 * @param[out] stalled  Endpoint stall status
 *
 * @return 0 on success, negative errno code on fail.
 */
int usb_dc_ep_is_stalled(struct device *dev, const uint8_t ep, uint8_t *stalled)
{
    uint8_t ep_idx = USB_EP_GET_IDX(ep);

    if (!stalled)
    {
        return -1;
    }

    *stalled = 0U;
    if (USB_EP_DIR_IS_OUT(ep))
    {
        if (USB_Get_EPx_Status(ep_idx) & USB_EP_STATUS_STALL && usb_fs_device.out_ep[ep_idx].is_stalled)
            *stalled = 1U;
    }
    else
    {
        if (USB_Get_EPx_Status(ep_idx) & USB_EP_STATUS_STALL && usb_fs_device.in_ep[ep_idx].is_stalled)
            *stalled = 1U;
    }

    return 0;
}

/**
 * @brief Write data to the specified endpoint
 *
 * This function is called to write data to the specified endpoint. The
 * supplied usbd_endpoint_callback function will be called when data is transmitted
 * out.
 *
 * @param dev
 * @param[in]  ep        Endpoint address corresponding to the one
 *                       listed in the device configuration table
 * @param[in]  data      Pointer to data to write
 * @param[in]  data_len  Length of the data requested to write. This may
 *                       be zero for a zero length status packet.
 * @param[out] ret_bytes Bytes scheduled for transmission. This value
 *                       may be NULL if the application expects all
 *                       bytes to be written
 *
 * @return 0 on success, negative errno code on fail.
 */
int usb_dc_ep_write(struct device *dev, const uint8_t ep, const uint8_t *data, uint32_t data_len, uint32_t *ret_bytes)
{
    uint8_t ep_idx;
    uint32_t timeout = 0x00FFFFFF;
    uint32_t ep_tx_fifo_addr;

