bouffalolab/bouffalo_sdk/drivers/bl702_driver/hal_drv/src/hal_usb.c
    ep_idx = USB_EP_GET_IDX(ep);
    /* Check if IN ep */
    if (USB_EP_GET_DIR(ep) != USB_EP_DIR_IN)
    {
        return -1;
    }

    /* Check if ep enabled */
    if (!usb_ep_is_enabled(ep))
    {
        return -2;
    }

    while (!USB_Is_EPx_RDY_Free(ep_idx))
    {
        timeout--;
        if (!timeout)
        {
            USB_DC_LOG_ERR("ep%d wait free timeout\r\n", ep);
            return -3;
        }
    }

    // key = irq_lock();
    if (!data)
    {
        if (!data_len)
        {
            /* Zero length packet */
            /* Clear NAK and enable ep */
            USB_Set_EPx_Status(USB_EP_GET_IDX(ep), USB_EP_STATUS_ACK);
            return 0;
        }
        else
        {
            USB_DC_LOG_ERR("data is null\r\n");
            return -4;
        }
    }

    if (data_len > usb_fs_device.in_ep[ep_idx].ep_cfg.ep_mps)
    {
        /* Check if transfer len is too big */
        data_len = usb_fs_device.in_ep[ep_idx].ep_cfg.ep_mps;
    }

    /* Wait for FIFO space available */
    do
    {
        uint32_t avail_space = USB_Get_EPx_TX_FIFO_CNT(ep_idx);
        if (avail_space >= usb_fs_device.in_ep[ep_idx].ep_cfg.ep_mps)
        {
            break;
        }
        //USB_DC_LOG_ERR("EP%d have remain data\r\n", ep_idx);
    }
    while (1);

    /*
     * Write data to FIFO, make sure that we are protected against
     * other USB register accesses.  According to "DesignWare Cores
     * USB 1.1/2.0 Device Subsystem-AHB/VCI Databook": "During FIFO
     * access, the application must not access the UDC/Subsystem
     * registers or vendor registers (for ULPI mode). After starting
     * to access a FIFO, the application must complete the transaction
     * before accessing the register."
     */
    ep_tx_fifo_addr = USB_BASE + USB_EP0_TX_FIFO_WDATA_OFFSET + ep_idx * 0x10;

    if((data_len == 1) && (ep_idx == 0))
    {
        USB_Set_EPx_Xfer_Size(EP_ID0,1);
    }
    else if(ep_idx == 0)
    {
        USB_Set_EPx_Xfer_Size(EP_ID0,64);
    }

    memcopy_to_fifo((void *)ep_tx_fifo_addr, (uint8_t *)data, data_len);
    /* Clear NAK and enable ep */
    USB_Set_EPx_Status(USB_EP_GET_IDX(ep), USB_EP_STATUS_ACK);

    USB_DC_LOG_DBG("EP%d write %u bytes\r\n", ep_idx, data_len);

    if (ret_bytes)
    {
        *ret_bytes = data_len;
    }

    return 0;
}

/**
 * @brief Read data from the specified endpoint
 *
 * This is similar to usb_dc_ep_read, the difference being that, it doesn't
 * clear the endpoint NAKs so that the consumer is not bogged down by further
 * upcalls till he is done with the processing of the data. The caller should
 * reactivate ep by invoking usb_dc_ep_read_continue() do so.
 * 
 * @param dev
 * @param[in]  ep           Endpoint address corresponding to the one
 *                          listed in the device configuration table
 * @param[in]  data         Pointer to data buffer to write to
 * @param[in]  max_data_len Max length of data to read
 * @param[out] read_bytes   Number of bytes read. If data is NULL and
 *                          max_data_len is 0 the number of bytes
 *                          available for read should be returned.
 *
 * @return 0 on success, negative errno code on fail.
 */
int usb_dc_ep_read(struct device *dev, const uint8_t ep, uint8_t *data, uint32_t data_len, uint32_t *read_bytes)
{
    uint8_t ep_idx = USB_EP_GET_IDX(ep);
    uint32_t read_count;
    uint32_t ep_rx_fifo_addr;
    uint32_t timeout = 0x00FFFFFF;
    /* Check if OUT ep */
    if (USB_EP_GET_DIR(ep) != USB_EP_DIR_OUT)
    {
        USB_DC_LOG_ERR("Wrong endpoint direction\r\n");
        return -1;
    }

    /* Check if ep enabled */
    if (!usb_ep_is_enabled(ep))
    {
        USB_DC_LOG_ERR("Not enabled endpoint\r\n");
        return -1;
    }
    /*common process for other ep out*/
    if(ep_idx)
    {
        while (!USB_Is_EPx_RDY_Free(ep_idx))
        {
            timeout--;
            if (!timeout)
            {
                USB_DC_LOG_ERR("ep%d wait free timeout\r\n", ep);
                return -USB_DC_EP_TIMEOUT_ERR;
            }
        }
    }
    /*special process for ep0 out*/
    else if(read_bytes && data_len && (ep_idx == 0))
    {
        while(((BL_RD_WORD(0x4000D800) & (1 << 28)) >> 28))
        {
            timeout--;
            if (!timeout)
            {
                USB_DC_LOG_ERR("ep%d wait free timeout\r\n", ep);
                return -USB_DC_EP_TIMEOUT_ERR;
            }
        }
    }

    /* Allow to read 0 bytes */
    if (!data_len)
    {
        /* Clear NAK and enable ep */
        USB_Set_EPx_Status(USB_EP_GET_IDX(ep), USB_EP_STATUS_ACK);
        return 0;
    }

    read_count = USB_Get_EPx_RX_FIFO_CNT(ep_idx);
    read_count = MIN(read_count, data_len);

    /* Data in the FIFOs is always stored per 8-bit word*/
    ep_rx_fifo_addr = (USB_BASE + USB_EP0_RX_FIFO_RDATA_OFFSET + ep_idx * 0x10);
    fifocopy_to_mem((void *)ep_rx_fifo_addr, data, read_count);
    USB_DC_LOG_DBG("Read EP%d, req %d, read %d bytes\r\n", ep, data_len, read_count);

    if (read_bytes)
    {
        *read_bytes = read_count;
    }

    return 0;
}
/**
 * @brief
 *
 * @param dev
 * @param rb
 * @param ep
 * @return int
 */
int usb_dc_receive_to_ringbuffer(struct device *dev, Ring_Buffer_Type *rb, uint8_t ep)
{
    uint8_t ep_idx;
    uint8_t recv_len;
    uint32_t timeout = 0x00FFFFFF;
    static bool overflow_flag = false;

    /* Check if OUT ep */
    if (USB_EP_GET_DIR(ep) != USB_EP_DIR_OUT)
    {
        USB_DC_LOG_ERR("Wrong endpoint direction\r\n");
        return -USB_DC_EP_DIR_ERR;
    }
    /* Check if ep enabled */
    if (!usb_ep_is_enabled(ep))
    {
        return -USB_DC_EP_EN_ERR;
    }

    ep_idx = USB_EP_GET_IDX(ep);

    while (!USB_Is_EPx_RDY_Free(ep_idx))
    {
        timeout--;
        if (!timeout)
        {
            USB_DC_LOG_ERR("ep%d wait free timeout\r\n", ep);
            return -USB_DC_EP_TIMEOUT_ERR;
        }
    }
    recv_len = USB_Get_EPx_RX_FIFO_CNT(ep_idx);
    
    /*if rx fifo count equal 0,it means last is send nack and ringbuffer is smaller than 64,
    * so,if ringbuffer is larger than 64,set ack to recv next data.
    */
    if(overflow_flag && (Ring_Buffer_Get_Empty_Length(rb)>64) && (!recv_len))
    {
        overflow_flag = false;
        USB_Set_EPx_Rdy(ep_idx);
        return 0;
    }
    else
    {
        uint32_t addr = USB_BASE + 0x11C + (ep_idx - 1) * 0x10;
        Ring_Buffer_Write_Callback(rb, recv_len, fifocopy_to_mem, (void *)addr);

        if(Ring_Buffer_Get_Empty_Length(rb) < 64)
        {
            overflow_flag = true;
            return -USB_DC_RB_SIZE_SMALL_ERR;
        }

