bouffalolab/bouffalo_sdk/drivers/bl702_driver/hal_drv/src/hal_usb.c
        USB_Set_EPx_Rdy(ep_idx);
        return 0;
    }
}
/**
 * @brief
 *
 * @param dev
 * @param rb
 * @param ep
 * @return int
 */
int usb_dc_send_from_ringbuffer(struct device *dev, Ring_Buffer_Type *rb, uint8_t ep)
{
    uint8_t ep_idx;
    uint32_t timeout = 0x00FFFFFF;
    static bool zlp_flag = false;
    static uint32_t send_total_len = 0;

    ep_idx = USB_EP_GET_IDX(ep);

    /* Check if IN ep */
    if (USB_EP_GET_DIR(ep) != USB_EP_DIR_IN)
    {
        return -USB_DC_EP_DIR_ERR;
    }

    /* Check if ep enabled */
    if (!usb_ep_is_enabled(ep))
    {
        return -USB_DC_EP_EN_ERR;
    }
    
    while (!USB_Is_EPx_RDY_Free(ep_idx))
    {
        timeout--;
        if (!timeout)
        {
            USB_DC_LOG_ERR("ep%d wait free timeout\r\n", ep);
            return -USB_DC_EP_TIMEOUT_ERR;
        }
    }

    uint32_t addr = USB_BASE + 0x118 + (ep_idx - 1) * 0x10;

    if(zlp_flag == false)
    {
        if ((USB_Get_EPx_TX_FIFO_CNT(ep_idx) == USB_FS_MAX_PACKET_SIZE) && Ring_Buffer_Get_Length(rb))
        {
            uint32_t actual_len = Ring_Buffer_Read_Callback(rb, USB_FS_MAX_PACKET_SIZE, memcopy_to_fifo, (void *)addr); 
            send_total_len += actual_len;

            if(!Ring_Buffer_Get_Length(rb) && (!(send_total_len % 64)))
            {
                zlp_flag = true;
            }

            USB_Set_EPx_Rdy(ep_idx);
            return 0;
        }
        else
        {
            return -USB_DC_RB_SIZE_SMALL_ERR;
        }
    }
    else
    {
        zlp_flag = false; 
        send_total_len = 0;
        USB_Set_EPx_Rdy(ep_idx);
        return -USB_DC_ZLP_ERR;
    }
}

/**
  * @brief  This function handles PCD interrupt request.
  * @param  hpcd PCD handle
  * @retval HAL status
  */

/**
 * @brief
 *
 * @param device
 */
void usb_dc_isr(usb_dc_device_t *device)
{
    USB_EP_ID epnum = EP_ID0;

    /* EP1_DONE -> EP2_DONE -> ...... -> EP7_DONE*/
    for (USB_INT_Type epint = USB_INT_EP1_DONE; epint <= USB_INT_EP7_DONE; epint += 2)
    {
        if (USB_Get_IntStatus(epint))
        {
            epnum = (epint - USB_INT_EP0_OUT_CMD) >> 1;
            device->parent.callback(&device->parent,(void*)((uint32_t)USB_SET_EP_OUT(epnum)),0,USB_DC_EVENT_EP_OUT_NOTIFY);
            USB_Clr_IntStatus(epint);
            return;
        }
    }

    /* EP1_CMD -> EP2_CMD -> ...... -> EP7_CMD*/
    for (USB_INT_Type epint = USB_INT_EP1_CMD; epint <= USB_INT_EP7_CMD; epint += 2)
    {
        if (USB_Get_IntStatus(epint))
        {
            epnum = (epint - USB_INT_EP0_OUT_CMD) >> 1;
            device->parent.callback(&device->parent,(void*)((uint32_t)USB_SET_EP_IN(epnum)),0,USB_DC_EVENT_EP_IN_NOTIFY);
            USB_Clr_IntStatus(epint);
            return;
        }
    }

    /* reset */
    if (USB_Get_IntStatus(USB_INT_SOF))
    {
        USB_DC_LOG("sof\r\n");
        device->parent.callback(&device->parent,NULL,0,USB_DC_EVENT_SOF);
        USB_Clr_IntStatus(USB_INT_SOF);
        return;
    }

    /* reset */
    if (USB_Get_IntStatus(USB_INT_RESET))
    {
        USB_DC_LOG("reset\r\n");
        device->parent.callback(&device->parent,NULL,0,USB_DC_EVENT_RESET);
        USB_Clr_IntStatus(USB_INT_RESET);
        return;
    }

    /* vbus toggle */
    if (USB_Get_IntStatus(USB_INT_VBUS_TGL))
    {
        USB_DC_LOG("vbus toggle\r\n");
        /*************************************/
        /*************************************/
        USB_Clr_IntStatus(USB_INT_VBUS_TGL);
        return;
    }

    /* EP0 setup done */
    if (USB_Get_IntStatus(USB_INT_EP0_SETUP_DONE))
    {
        USB_DC_LOG("S\r\n");
        device->parent.callback(&device->parent,NULL,0,USB_DC_EVENT_SETUP_NOTIFY);
        USB_Clr_IntStatus(USB_INT_EP0_SETUP_DONE);
        return;
    }

    /* EP0 in done */
    if (USB_Get_IntStatus(USB_INT_EP0_IN_DONE))
    {
        USB_DC_LOG("I\r\n");
        device->parent.callback(&device->parent,(void*)0x80,0,USB_DC_EVENT_EP0_IN_NOTIFY);
        USB_Clr_IntStatus(USB_INT_EP0_IN_DONE);
        return;
    }

    /* EP0 out done */
    if (USB_Get_IntStatus(USB_INT_EP0_OUT_DONE))
    {
        USB_DC_LOG("O\r\n");
        device->parent.callback(&device->parent,(void*)0x00,0,USB_DC_EVENT_EP0_OUT_NOTIFY);
        /*************************************/
        USB_Clr_IntStatus(USB_INT_EP0_OUT_DONE);
        return;
    }

    /* reset end */
    if (USB_Get_IntStatus(USB_INT_RESET_END))
    {
        USB_DC_LOG("re\r\n");
        /*************************************/
        USB_Set_EPx_Rdy(EP_ID0);
        /*************************************/
        USB_Clr_IntStatus(USB_INT_RESET_END);
        return;
    }

    /* LPM wakeup */
    /* usb wakeup interrupt, need update by reg_excel_files */
    if (USB_Get_IntStatus(USB_INT_LPM_WAKEUP))
    {
        /*************************************/
        /*set wInterrupt_Mask global variable*/
        //HAL_PCD_ResumeCallback(hpcd);
        /*************************************/
        USB_Clr_IntStatus(USB_INT_LPM_WAKEUP);
        return;
    }

    /* LPM packet */
    /* usb suspend interrupt, need update by reg_excel_files */
    if (USB_Get_IntStatus(USB_INT_LPM_PACKET))
    {
        /*************************************/
        /* Force low-power mode in the macrocell */
        if (USB_Get_IntStatus(USB_INT_LPM_WAKEUP) == 0)
        {
            //HAL_PCD_SuspendCallback(hpcd);
        }
        /*************************************/
        USB_Clr_IntStatus(USB_INT_LPM_PACKET);
        return;
    }

    /* lost 3 SOF */
    if (USB_Get_IntStatus(USB_INT_LOST_SOF_3_TIMES))
    {
        USB_DC_LOG_ERR("Lost 3 SOFs\r\n");
        /*************************************/
        /*************************************/
        USB_Clr_IntStatus(USB_INT_LOST_SOF_3_TIMES);
        return;
    }
    /* error */
    if (USB_Get_IntStatus(USB_INT_ERROR))
    {
        USB_DC_LOG("USB bus error 0x%08x; EP2 fifo status 0x%08x\r\n", *(volatile uint32_t *)(0x4000D81C), *(volatile uint32_t *)(0x4000D920));
        /*************************************/
        /*************************************/
        device->parent.callback(&device->parent,NULL,0,USB_DC_EVENT_ERROR);
        USB_Clr_IntStatus(USB_INT_ERROR);
        return;
    }
}
/**
 * @brief
 *
 */
void USB_IRQHandler(void)
{
    usb_dc_isr(&usb_fs_device);
}